In [3]:
import pandas as pd
df=pd.read_excel("newIT.xlsx")
print (df)

     SL.NO.  COLLEGE ID  COURSE STREAM TCS - DT/CT REFERENCE NUMBER  \
0         1  2110902041  B.TECH     IT                DT20245696416
1         2  2110902148  B.TECH     IT                DT20245718444
2         3  2110902057  B.TECH     IT                CT20244429167
3         4  2110902141  B.TECH     IT                DT20245713894
4         5  2110902147  B.TECH     IT                DT20245716922
..      ...         ...     ...    ...                          ...
166     169  2110902187  B.TECH     IT                DT20234687021
167     170  2110902204  B.TECH     IT                DT20245718476
168     171  2110902199  B.TECH     IT                CT20244429207
169     172  2110902175  B.TECH     IT                DT20245748819
170     173  2110902096  B.TECH     IT                DT20245717572

      FIRST NAME MIDDLE NAME(WHEREVER APPLICABLE) LAST NAME  GENDER  \
0        AAKASH                               NaN     SHAW     Male
1    Abdussalam                               NaN    Ghous     Male
2          ABHIK                              NaN  MAJUMDAR    Male
3       ABHISHEK                              NaN    MAHATA    Male
4           Abir                              NaN       Roy    Male
..           ...                              ...       ...     ...
166       Vishal                            Kumar       Das    Male
167       VISHAL                              NaN    SHARMA    Male
168    YASHASWI                               NaN   KUMARI   Female
169       YUGANT                              NaN     SINGH    Male
170       ZUNAIB                              NaN      KHAN    Male

    D.O.B (DD/MM/YYYY FORMAT ONLY)  ...  \
0                       01/11/2001  ...
1                       11/10/2001  ...
2                       15/09/2002  ...
3                       10/05/2003  ...
4                       02/11/2001  ...
..                             ...  ...
166                     28/08/2003  ...
167                     02/06/2003  ...
168                     10/07/2004  ...
169                     07/03/2002  ...
170                     10/06/2002  ...

                PERMANENT - ADDRESS FOR CORRESPONDENCE  \
0                    51/4/C/1, RABINDRA SARANI, LILUAH
1                   26, Zakaria Street, Kolkata-700073
2                          SANTINAGAR VIVEKANANDA ROAD
3                       LODHASULI,JHARGRAM,WEST BENGAL
4    Po: Pratapdighi, Dist: East Medinipur, Pin:721440
..                                                 ...
166     vill-Rambhadrapur ,post-madanpur,ps-bahadurpur
167  VILL SULLAN WARD NO.1 , TEHSIL RAMNAGAR, DIST ...
168  House no 49, lic colony,near LIC COMMUNITY HAL...
169        DAMODA COLLIERY NO.2, RANIGANJ, WEST BENGAL
170          SHAHMAT HUSSAIN LANE,ISLAMNAGAR,BARAHPURA

     PERMANENT LOCATION (PLACE - CITY/TOWN/VILLAGE)  \
0                                  KOLKATA -KOLKATA
1                                          Kolkata
2                                           ASANSOL
3                                         LODHASULI
4                                       Pratapdighi
..                                              ...
166  vill-Rambhadrapur ,post-madanpur,ps-bahadurpur
167            VILLAGE SULLAN DIST UDHAMPUR  -JAMMU
168                                           PATNA
169                                        RANIGANJ
170                                       BHAGALPUR

    PERMANENT LOCATION (DISTRICT) PERMANENT LOCATION (STATE)  \
0                        KOLKATA                WEST BENGAL
1                        Kolkata                 West Bengal
2               PASCHIM BARDHAMAN                WEST BENGAL
3                        JHARGRAM                WEST BENGAL
4                   East Midnapur                West Bengal
..                            ...                        ...
166                     Darbhanga                      Bihar
167                     UDHAMPUR          JAMMU AND KASHMIR
168                         PATNA                      BIHAR
169             PASCHIM BARDHAMAN                WEST BENGAL
170                     BHAGALPUR                      BIHAR

    PERMANENT LOCATION (PIN CODE)  \
0                          711204
1                          700073
2                          713325
3                          721513
4                          721440
..                            ...
166                        847101
167                        182122
168                        800020
169                        713358
170                        812001

                                       PRESENT ADDRESS  \
0                    51/4/C/1, RABINDRA SARANI, LILUAH
1                  26, Zakaria Street, kolkata -700073
2    PANCHPOTA, NEAR POLICE PARA TOTO STAND , NEW G...
3                                                GARIA
4                                                Garia
..                                                 ...
166    saha Civil construction ,near toto-stand ,garia
167  NIHAL APARTMENT, NEAR TOTO STAND, PANCHPOTA GA...
168  House no 49, lic colony,near LIC COMMUNITY HAL...
169        DAMODA COLLIERY NO.2, RANIGANJ, WEST BENGAL
170       BIKASH GUHA COLONY , TECHNO CITY , PANCHPOTA

     PRESENT LOCATION (PLACE - CITY/TOWN/VILLAGE) PRESENT LOCATION (DISTRICT)  \
0                               KOLKATA -KOLKATA                     KOLKATA
1                                        Kolkata                     Kolkata
2                                         KOLKATA                     KOLKATA
3                                           GARIA           SOUTH 24 PARGANAS
4                                           Garia                     Kolkata
..                                            ...                         ...
166                                       Kolkata                     Kolkata
167                                 GARIA-KOLKATA           SOUTH 24 PARGANAS
168                                         PATNA                       PATNA
169                                       KOLKATA           SOUTH 24 PARGANAS
170                                        GARIA            SOUTH 24 PARGANAS

    PRESENT LOCATION (STATE) PRESENT LOCATION (PIN CODE)
0               WEST BENGAL                       711204
1                   Kolkata                       700073
2                WEST BENGAL                      700152
3                WEST BENGAL                      700152
4                West Bengal                      700152
..                       ...                         ...
166              West-Bengal                      700152
167             WEST BENGAL                       700152
168                    BIHAR                      800020
169              WEST BENGAL                      700152
170              WEST BENGAL                      700152

[171 rows x 164 columns]

In [5]:
import pandas as pd
dict={"name":["Shubham","Kishan","Rahul","Deepak"],
      "age":[22,21,21,20],
      "Salary":[90999,60000,50000,55000]}
df=pd.DataFrame(dict)
print(df)

      name  age  Salary
0  Shubham   22   90999
1   Kishan   21   60000
2    Rahul   21   50000
3   Deepak   20   55000

In [6]:
print(df.head(2))

      name  age  Salary
0  Shubham   22   90999
1   Kishan   21   60000

In [7]:
print(df.tail(1))

     name  age  Salary
3  Deepak   20   55000

In [8]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
 2   Salary  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes
None

In [9]:
print(df.describe())

             age        Salary
count   4.000000      4.000000
mean   21.000000  63999.750000
std     0.816497  18456.669984
min    20.000000  50000.000000
25%    20.750000  53750.000000
50%    21.000000  57500.000000
75%    21.250000  67749.750000
max    22.000000  90999.000000

In [10]:
 print(df.isnull())

    name    age  Salary
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False

In [11]:
print(df.isnull().sum())

name      0
age       0
Salary    0
dtype: int64

In [12]:
import pandas as pd
df=pd.read_csv("company1.csv")
print(df)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [13]:
df.duplicate()

AttributeError: 'DataFrame' object has no attribute 'duplicate'

In [14]:
print(df.duplicated())

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [17]:
print(df.duplicated(['EEID']))

0    False
1    False
2    False
3     True
4    False
5    False
6     True
dtype: bool

In [18]:
print(df.duplicated(['EEID'].sum())

SyntaxError: incomplete input (3992702663.py, line 1)

In [19]:
print(df.['EEID'].duplicated()

SyntaxError: invalid syntax (1158676977.py, line 1)

In [20]:
print(df['EEID'].duplicated())

0    False
1    False
2    False
3     True
4    False
5    False
6     True
Name: EEID, dtype: bool

In [21]:
print(df['EEID'].duplicated().sum())

2

In [22]:
df.drop_duplicates("EEID")

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN

In [23]:
print(df.drop_duplicates("EEID"))

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN

In [25]:
import pandas as pd
import numpy as np

data=pd.read_csv("company1.csv")
print(data.isnull())
print(data.isnull().sum())

    EEID   Name  gender  salary
0  False  False   False    True
1  False  False   False   False
2  False  False    True   False
3  False  False   False   False
4  False   True   False   False
5  False  False   False    True
6  False  False   False   False
EEID      0
Name      1
gender    1
salary    2
dtype: int64

In [26]:
print(data.dropna())

    EEID    Name gender   salary
1  EMP02   rohit      M  25000.0
3  EMP01  ayushi      F  20000.0
6  EMP02   rohit      M  25000.0

In [29]:
print(data.replace(np.nan,"X"))

    EEID      Name gender   salary
0  EMP01    ayushi      F        X
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      X  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05         X      M  25000.0
5  EMP06     rohit      M        X
6  EMP02     rohit      M  25000.0

In [32]:
data["salary"]=data["salary"].replace(np.nan,300000)

In [33]:
print(data["salary"]=data["salary"].replace(np.nan,300000))

SyntaxError: expression cannot contain assignment, perhaps you meant "=="? (1980649040.py, line 1)

In [34]:
print data

SyntaxError: Missing parentheses in call to 'print'. Did you mean print(...)? (4178071618.py, line 1)

In [35]:
print(data)

    EEID      Name gender    salary
0  EMP01    ayushi      F  300000.0
1  EMP02     rohit      M   25000.0
2  EMP03  pranjali    NaN   27000.0
3  EMP01    ayushi      F   20000.0
4  EMP05       NaN      M   25000.0
5  EMP06     rohit      M  300000.0
6  EMP02     rohit      M   25000.0

In [36]:
print(data["salary"].mean())

103142.85714285714

In [42]:
import pandas as pd
import numpy as np
data1=pd.read_csv("company1.csv")
data1["salary"]=data1["salary"].replace(np.nan,103142.85714285714)
print(data1)
print(data1["salary"].mean())

    EEID      Name gender         salary
0  EMP01    ayushi      F  103142.857143
1  EMP02     rohit      M   25000.000000
2  EMP03  pranjali    NaN   27000.000000
3  EMP01    ayushi      F   20000.000000
4  EMP05       NaN      M   25000.000000
5  EMP06     rohit      M  103142.857143
6  EMP02     rohit      M   25000.000000
46897.959183673476

In [38]:
print (data)

    EEID      Name gender    salary
0  EMP01    ayushi      F  300000.0
1  EMP02     rohit      M   25000.0
2  EMP03  pranjali    NaN   27000.0
3  EMP01    ayushi      F   20000.0
4  EMP05       NaN      M   25000.0
5  EMP06     rohit      M  300000.0
6  EMP02     rohit      M   25000.0

In [44]:
data=pd.read_csv("company1.csv")
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [45]:
data.fillna(method="bfill

SyntaxError: unterminated string literal (detected at line 1) (1151442188.py, line 1)

In [46]:
data.fillna(method="bfill")
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

C:\Users\satya\AppData\Local\Temp\ipykernel_6664\48265385.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method="bfill")

In [47]:
print(data.fillna(method="bfill"))

    EEID      Name gender   salary
0  EMP01    ayushi      F  25000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     rohit      M  25000.0
5  EMP06     rohit      M  25000.0
6  EMP02     rohit      M  25000.0

C:\Users\satya\AppData\Local\Temp\ipykernel_6664\2075060948.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method="bfill"))

In [50]:
data=pd.read_csv("company1.csv")
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [49]:
print(data.bfill())

    EEID      Name gender   salary
0  EMP01    ayushi      F  25000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     rohit      M  25000.0
5  EMP06     rohit      M  25000.0
6  EMP02     rohit      M  25000.0

In [51]:
print(data.ffill())

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      M  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05    ayushi      M  25000.0
5  EMP06     rohit      M  25000.0
6  EMP02     rohit      M  25000.0